[
{"name": "9.4", "score": "9.4", "description": "Managed by a private host"},
{"name": "7.7", "score": "7.7", "description": "Located in the peaceful Courtoisville district, 150 metres from the beach and 5 minutes from the thermal baths, the Brit Hotel offers charming rooms equipped with free Wi-Fi internet access. "},
{"name": "9.7", "score": "9.7", "description": "Managed by a private host"},
{"name": "9.0", "score": "9.0", "description": "Résidence Quai Sud- Le Charcot offers pet-friendly accommodation in Saint Malo, just 50 metres from Sillon Beach and a few steps from Espace Duguay Trouin. "},
{"name": "8.9", "score": "8.9", "description": "Résidence Quai Sud-Le Bourdonnais is a self-catering accommodation located in Saint Malo, a few steps away from the beach and 500 m from Intra-Muros, the historical centre of Saint-Malo. "},
{"name": "9.5", "score": "9.5", "description": "Managed by a private host"},
{"name": "8.4", "score": "8.4", "description": "The Oceania Saint Malo hotel faces the sea and is located on Chaussée du Sillon, opposite Sillon Beach and 450 metres from Saint-Malo Marina. "},
{"name": "9.7", "score": "9.7", "description": "Set in Saint Malo, just 500 metres from the old town, this apartment features free WiFi and a balcony. The property is a few steps from Espace Duguay Trouin and free private parking is available. "},
{"name": "7.3", "score": "7.3", "description": "Offering free WiFi and free private parking, Le 1684 is located in Saint Malo, within just 400 metres of Eventail Beach. "},
{"name": "8.5", "score": "8.5", "description": "Set in the historical centre of Saint-Malo, this 4-star hotel is just a 5-minute walk from the cathedral and 120 metres from Saint-Malo Marina. "},
{"name": "8.0", "score": "8.0", "description": "Le Valmarin is a 18th-century Malouinière, enclosed in a 3000 m² tree-lined park. It is located a 5-minute walk from the beaches of Saint-Malo. The property offers free Wi-Fi internet access. "},
{"name": "9.0", "score": "9.0", "description": "Les Lauriers - dans l'Intramuros in Saint Malo offers accommodation with free WiFi, 200 metres from Bon Secours Beach, 300 metres from Mole Beach and 700 metres from Eventail Beach. "},
{"name": "8.5", "score": "8.5", "description": "Managed by a private host"},
{"name": "8.1", "score": "8.1", "description": "Located in Saint Malo, this apartment is 30 metres from the beach and 600 metres from the town centre. The apartment is 250 metres from Ferry Terminal du Naye and a 4-minute walk from a public pool. "},
{"name": "7.7", "score": "7.7", "description": "Offering a snack bar and free WiFi, ibis Styles Saint Malo Port is located in Saint Malo, less than a 10-minute walk from the sandy beaches and 1 km from Saint-Malo Train Station. "},
{"name": "8.2", "score": "8.2", "description": "Logement de charme - Saint-Malo intramuros in Saint Malo features accommodation with free WiFi, 200 metres from Bon Secours Beach, 400 metres from Mole Beach and 700 metres from Eventail Beach. "},
{"name": "8.7", "score": "8.7", "description": "Set in a property originally built in the 16th century, Hotel des Abers is situated in central Saint Malo, 400 metres from Saint-Malo Casino and 500 metres from Cale de Dinan Ferry. "},
{"name": "9.1", "score": "9.1", "description": "Managed by a private host"},
{"name": "7.6", "score": "7.6", "description": "Situated in Saint Malo, 400 metres from Bas-Sablons Beach, Solidor appartement St Malo vue sur mer proche FERRY features accommodation with a casino, free WiFi and a 24-hour front desk. "},
{"name": "8.7", "score": "8.7", "description": "The 17th-century Manoir Du Cunningham is located on the seafront, just a 10-minute walk from the Old Town in Saint-Malo. It offers rooms and suites with flat-screen TV and radio. "},
{"name": "9.7", "score": "9.7", "description": "Set in Saint Malo, just 300 metres from Bon Secours Beach, Le Pilo offers beachfront accommodation with free WiFi. "},
{"name": "7.0", "score": "7.0", "description": "Managed by a private host"},
{"name": "7.1", "score": "7.1", "description": "Situated in Saint Malo, 300 metres from Rochebonne Beach and 500 metres from Minihic Beach, Rochebonne Plage features accommodation with free WiFi and a garden with a barbecue and garden views. "},
{"name": "8.3", "score": "8.3", "description": "Best Western Alexandra is a hotel with direct access to the beach in Saint Malo, and offers sweeping views over the beach and sea. "},
{"name": "9.2", "score": "9.2", "description": "Managed by a private host"}
]